{
    "General Conversation": {
      "A1": {
        "grammar": [
          "Simple present tense",
          "Basic noun-verb agreement",
          "Definite and indefinite articles (el, la, un, una)",
          "Personal pronouns (yo, tú, él, ella)",
          "Basic question formation",
          "Basic adjective agreement",
          "Numbers (1-20)",
          "Days of the week"
        ],
        "examples": [
          "Hola, ¿cómo estás?",
          "Me llamo Ana.",
          "¿Dónde vives?",
          "Vivo en una casa grande.",
          "¿Cuántos años tienes?",
          "Tengo veinte años.",
          "Este es mi amigo Pedro.",
          "¿Qué haces hoy?",
          "Voy al parque.",
          "Tengo un perro pequeño.",
          "¿Tienes hermanos?",
          "Sí, tengo un hermano.",
          "El libro está en la mesa.",
          "¿Qué día es hoy?",
          "Hoy es lunes.",
          "Mi color favorito es azul.",
          "Me gusta la pizza.",
          "No me gusta el café.",
          "¿Quieres ir al cine?",
          "Sí, me gusta ver películas."
        ]
      },
      "A2": {
        "grammar": [
          "Present tense",
          "Question formation",
          "Possessive adjectives (mi, tu, su)",
          "Adjective agreement",
          "Use of 'gustar' (to like)",
          "Prepositions of place (en, a, de)",
          "Basic negation (no)",
          "Numbers (20-100)"
        ],
        "examples": [
          "¿A qué hora te levantas?",
          "Me levanto a las siete.",
          "¿Qué te gusta hacer en tu tiempo libre?",
          "Me gusta leer libros.",
          "Voy a la escuela todos los días.",
          "¿Cuál es tu comida favorita?",
          "Mi comida favorita es la pasta.",
          "El coche de mi hermano es rojo.",
          "¿Dónde está el supermercado?",
          "El supermercado está cerca de mi casa.",
          "¿Qué día de la semana prefieres?",
          "Prefiero el viernes.",
          "Ella es más alta que su hermana.",
          "¿A qué hora comes?",
          "Como a las dos de la tarde.",
          "Los estudiantes están en clase.",
          "¿Qué te gusta hacer los fines de semana?",
          "Me gusta ir al cine.",
          "No me gusta el frío.",
          "El perro está bajo la mesa.",
          "¿Qué quieres hacer mañana?"
        ]
      },
      "B1": {
        "grammar": [
          "Present tense with regular verbs",
          "Basic sentence structure",
          "Prepositions of place (en, a, de)",
          "Use of 'hay' (there is/are)",
          "Direct and indirect object pronouns",
          "Past simple tense (preterite)",
          "Reflexive verbs (levantarse, lavarse)",
          "Conjunctions (y, o, pero)"
        ],
        "examples": [
          "Ayer fui al supermercado.",
          "¿Has visto mi teléfono?",
          "Estoy estudiando para el examen.",
          "Quiero aprender a tocar la guitarra.",
          "¿Cuánto cuesta esta camisa?",
          "La película fue muy emocionante.",
          "¿Qué hiciste el fin de semana pasado?",
          "Fui a la playa con mis amigos.",
          "Mi casa está lejos del centro.",
          "Hay muchas personas en la fiesta.",
          "Ella se levanta temprano todos los días.",
          "¿Dónde está la estación de tren?",
          "El café está muy caliente.",
          "¿Qué prefieres, té o café?",
          "Mi hermano está en la universidad.",
          "Nosotros compramos una nueva televisión.",
          "Estoy cansado porque no dormí bien.",
          "Ella me dio el libro ayer.",
          "El perro está jugando en el jardín.",
          "Voy a viajar a España este verano."
        ]
      },
      "B2": {
        "grammar": [
          "Present tense with irregular verbs",
          "Questions and negations",
          "Comparatives and superlatives",
          "Past simple tense (preterite)",
          "Use of reflexive verbs",
          "Future tense",
          "Conditional tense",
          "Subjunctive mood (basic)"
        ],
        "examples": [
          "Si tuviera más tiempo, estudiaría francés.",
          "¿Cuándo vienes a la fiesta?",
          "Espero que vengas a mi cumpleaños.",
          "Quiero que me ayudes con la tarea.",
          "El coche más rápido ganó la carrera.",
          "Me gustaría visitar París algún día.",
          "¿Has probado la comida española?",
          "El examen fue más difícil de lo que esperaba.",
          "Voy a ir al médico mañana.",
          "¿Qué harías si ganaras la lotería?",
          "Espero que podamos vernos pronto.",
          "Si hace sol mañana, iremos a la playa.",
          "No creo que él vaya a venir.",
          "¿Puedes ayudarme con este problema?",
          "Estoy buscando un buen libro para leer.",
          "Creo que él es más inteligente que su hermano.",
          "Ella está estudiando para ser doctora.",
          "¿A qué hora vas a salir?",
          "Si pudieras viajar a cualquier lugar, ¿a dónde irías?",
          "Mi sueño es vivir en el extranjero."
        ]
      },
      "C1": {
        "grammar": [
          "Present continuous tense",
          "Direct and indirect objects",
          "Past continuous tense",
          "Future tense",
          "Conditional tense",
          "Subjunctive mood (intermediate)",
          "Relative clauses",
          "Passive voice"
        ],
        "examples": [
          "Si hubiera sabido que venías, habría preparado algo de comer.",
          "No creo que ella esté diciendo la verdad.",
          "Es importante que los estudiantes estudien todos los días.",
          "La película que vimos ayer fue increíble.",
          "El proyecto fue completado por el equipo en tiempo récord.",
          "¿Qué piensas hacer este fin de semana?",
          "Voy a estar trabajando en un nuevo proyecto.",
          "Si hubiera tenido más tiempo, habría terminado el informe.",
          "El libro que estoy leyendo es muy interesante.",
          "Espero que puedas venir a la fiesta.",
          "Es probable que llueva mañana.",
          "Si pudiera hablar con él, le pediría una explicación.",
          "Estoy buscando un apartamento que tenga dos habitaciones.",
          "No estoy seguro de que él haya entendido lo que dije.",
          "La casa fue construida por un famoso arquitecto.",
          "No pienso que vaya a ser fácil.",
          "Es probable que me mude a otra ciudad el próximo año.",
          "La comida fue preparada por un chef profesional.",
          "¿Sabes si ellos han tomado una decisión?",
          "Si hubiera sabido antes, habría hecho algo diferente."
        ]
      },
      "C2": {
        "grammar": [
          "Present perfect tense",
          "Reflexive verbs",
          "Subjunctive mood (advanced)",
          "Complex sentence structures",
          "Reported speech",
          "Idiomatic expressions",
          "Advanced relative clauses",
          "Imperfect tense",
          "Pluperfect tense"
        ],
        "examples": [
          "Aunque hubiera tenido más tiempo, no habría podido completar el proyecto.",
          "Me sorprendió que hubieran terminado tan temprano.",
          "Es cierto que la situación es complicada, pero no imposible.",
          "Ella dijo que vendría mañana, pero no estoy seguro.",
          "Si hubiera sabido lo que sé ahora, habría actuado de manera diferente.",
          "Es probable que haya ocurrido un error en el sistema.",
          "Dudo que él pueda hacerlo sin ayuda.",
          "Si hubiera tenido la oportunidad, habría viajado más.",
          "El trabajo fue completado mucho antes de lo previsto.",
          "Es probable que él haya mentido sobre su experiencia.",
          "Si me hubieras escuchado, no estaríamos en este problema.",
          "No creo que haya sido una decisión correcta.",
          "Es increíble lo que ha logrado en tan poco tiempo.",
          "Aunque me hubiera gustado ir, no pude hacerlo.",
          "Si hubiera tenido más dinero, habría comprado esa casa.",
          "Espero que te haya gustado la presentación.",
          "Me pregunto si habrían aceptado mi propuesta.",
          "Es importante que sepas la verdad antes de tomar una decisión.",
          "Dijo que lo haría, pero no estoy seguro de que lo cumpla.",
          "Si hubiera sabido todo esto antes, habría hecho las cosas de otra manera."
        ]
      }
    },
    "Weather": {
        "A1": {
        "grammar": [
            "Simple present tense",
            "Basic noun-verb agreement",
            "Definite and indefinite articles (el, la, un, una)",
            "Personal pronouns (yo, tú, él, ella)",
            "Basic question formation",
            "Basic adjective agreement",
            "Numbers (1-20)",
            "Days of the week"
        ],
            "examples": [
                "Hace sol hoy.",
                "¿Qué tiempo hace?",
                "Hace frío.",
                "Está nublado.",
                "Está lloviendo.",
                "Hace calor.",
                "Hoy es lunes y hace viento.",
                "Mañana va a hacer sol.",
                "El clima está bueno hoy.",
                "Hay muchas nubes en el cielo.",
                "Hace mucho viento.",
                "Está nevando.",
                "Ayer hizo calor.",
                "Mañana va a llover.",
                "Hace sol en verano.",
                "Hace frío en invierno.",
                "¿Está nevando?",
                "No hace sol hoy.",
                "El cielo está azul.",
                "Hay tormenta."
            ]
        },
        "A2": {
            "grammar": [
                "Present tense",
                "Question formation",
                "Possessive adjectives (mi, tu, su)",
                "Adjective agreement",
                "Use of 'gustar' (to like)",
                "Prepositions of place (en, a, de)",
                "Basic negation (no)",
                "Numbers (20-100)"
            ],
            "examples": [
                "El verano pasado hizo mucho calor.",
                "Me gusta cuando hace sol.",
                "¿Qué tiempo va a hacer mañana?",
                "En mi ciudad siempre hace frío en invierno.",
                "Está lloviendo mucho en abril.",
                "No me gusta el viento fuerte.",
                "Hoy hay tormenta, mejor nos quedamos en casa.",
                "El clima en la costa es muy húmedo.",
                "El pronóstico dice que mañana va a hacer sol.",
                "El otoño es mi estación favorita porque no hace mucho calor.",
                "No me gusta cuando hace demasiado calor.",
                "Las temperaturas son más bajas en la montaña.",
                "Ayer nevó mucho.",
                "No quiero salir si está lloviendo.",
                "Me gusta cuando hay nubes en el cielo.",
                "Prefiero los días soleados.",
                "En mi país, llueve mucho en la primavera.",
                "Hoy hace mucho viento, deberíamos cerrar las ventanas.",
                "¿Está haciendo buen tiempo donde vives?",
                "Las temperaturas bajarán mañana."
            ]
        },
        "B1": {
            "grammar": [
                "Present tense with regular verbs",
                "Basic sentence structure",
                "Prepositions of place (en, a, de)",
                "Use of 'hay' (there is/are)",
                "Direct and indirect object pronouns",
                "Past simple tense (preterite)",
                "Reflexive verbs (levantarse, lavarse)",
                "Conjunctions (y, o, pero)"
            ],
            "examples": [
                "Ayer hizo mucho calor, por eso fuimos a la playa.",
                "Hoy hace un poco de viento, pero el sol está brillando.",
                "Me levanté temprano porque quería aprovechar el buen tiempo.",
                "¿Viste el pronóstico? Dicen que va a llover todo el día.",
                "Si hace buen tiempo mañana, vamos a hacer una caminata.",
                "Las temperaturas subieron esta semana, por eso hace tanto calor.",
                "Me gusta más el clima fresco que el calor del verano.",
                "En invierno, siempre tengo que usar una chaqueta gruesa.",
                "El sol salió después de la lluvia, fue hermoso.",
                "El viento estaba tan fuerte que no pudimos caminar bien.",
                "Prefiero los días nublados porque no hace tanto calor.",
                "El otoño es una época del año en la que hace fresco pero no frío.",
                "Hace tanto calor que no quiero salir de casa.",
                "Aunque estaba nublado, no llovió.",
                "El clima cambió rápidamente, primero llovía y luego salió el sol.",
                "¿Cuándo fue la última vez que nevó aquí?",
                "Siempre me siento mejor cuando hace sol.",
                "Si llueve esta tarde, cancelaremos el picnic.",
                "Me encanta escuchar la lluvia cuando estoy en casa.",
                "Cuando hace frío, prefiero quedarme en casa con una bebida caliente."
            ]
        },
        "B2": {
            "grammar": [
                "Present tense with irregular verbs",
                "Questions and negations",
                "Comparatives and superlatives",
                "Past simple tense (preterite)",
                "Use of reflexive verbs",
                "Future tense",
                "Conditional tense",
                "Subjunctive mood (basic)"
            ],
            "examples": [
                "Si sigue lloviendo, las calles se inundarán.",
                "Me pregunto si el clima será tan agradable mañana como lo fue hoy.",
                "El verano pasado fue más cálido que cualquiera que haya vivido.",
                "El pronóstico indica que podríamos tener una tormenta por la tarde.",
                "Si tuviera que elegir, preferiría los inviernos fríos a los veranos calurosos.",
                "Me dijeron que llovería, pero el cielo sigue despejado.",
                "¿Has visto cómo cambió el clima tan rápido?",
                "El viento ha sido constante desde la mañana.",
                "¿Qué harías si te encontraras atrapado en una tormenta?",
                "Si hace buen tiempo el fin de semana, podemos hacer una excursión.",
                "El clima está mucho mejor de lo que esperaba para esta época del año.",
                "Si estuviera nevando ahora, saldría a hacer fotos del paisaje.",
                "No creo que vaya a llover, pero llevaré un paraguas por si acaso.",
                "El pronóstico sugiere que podría nevar esta noche.",
                "Espero que el viento no sea tan fuerte mañana.",
                "Si pudiera elegir, viviría en un lugar donde siempre hace buen tiempo.",
                "Me encanta cómo cambia el cielo después de una tormenta.",
                "El verano aquí es más caluroso que en cualquier otro lugar en el que he estado.",
                "Si el clima sigue así, cancelaremos el evento.",
                "No sabía que en esta región lloviera tanto durante el otoño."
            ]
        },
        "C1": {
            "grammar": [
                "Present continuous tense",
                "Direct and indirect objects",
                "Past continuous tense",
                "Future tense",
                "Conditional tense",
                "Subjunctive mood (intermediate)",
                "Relative clauses",
                "Passive voice"
            ],
            "examples": [
                "Si el pronóstico hubiera sido más preciso, habría llevado un paraguas.",
                "No sé por qué, pero siempre que hace calor me siento más cansado.",
                "Me gusta salir a caminar cuando el clima es fresco y hay una brisa suave.",
                "Si hubiera sabido que haría tanto frío, habría traído un abrigo más grueso.",
                "Es probable que la temperatura baje considerablemente esta noche.",
                "Si las condiciones no mejoran, podrían cancelar el vuelo.",
                "No puedo creer que estuviera nevando en pleno abril.",
                "El clima en esta región suele ser muy impredecible durante el otoño.",
                "Si el clima mejora, continuaremos con los planes para la fiesta.",
                "Parece que habrá una tormenta eléctrica más tarde.",
                "No me habría sorprendido si hubiera nevado ayer, hacía tanto frío.",
                "El viento ha estado soplando fuerte todo el día, es agotador.",
                "Si hubiera sabido que la tormenta sería tan intensa, no habría salido de casa.",
                "Las temperaturas están bajando rápidamente, y el viento no ayuda.",
                "Espero que no llueva el día de la boda, pero parece que las probabilidades no están a nuestro favor.",
                "El cielo estaba tan oscuro que parecía que iba a llover en cualquier momento.",
                "Si las lluvias no cesan, tendremos que posponer el evento.",
                "Es extraño cómo la temperatura cambia tan drásticamente en solo unas horas.",
                "La lluvia no paraba, así que decidimos cancelar la excursión.",
                "Aunque hace frío, es un tipo de frío seco que no se siente tan mal."
            ]
        },
        "C2": {
            "grammar": [
                "Present perfect tense",
                "Reflexive verbs",
                "Subjunctive mood (advanced)",
                "Complex sentence structures",
                "Reported speech",
                "Idiomatic expressions",
                "Advanced relative clauses",
                "Imperfect tense",
                "Pluperfect tense"
            ],
            "examples": [
                "Aunque hubiera hecho más calor, no creo que hubiéramos disfrutado tanto de la caminata.",
                "Dijeron que el clima mejoraría, pero ha estado lloviendo todo el día.",
                "Si hubiera sabido que el viento sería tan fuerte, no habría salido en bicicleta.",
                "Me parece que el clima en esta región ha cambiado mucho en los últimos años.",
                "Si no hubiera llovido tanto, las plantas no habrían crecido tanto.",
                "El pronóstico indicaba lluvia, pero no cayó ni una gota.",
                "Me encanta la forma en que el sol brilla después de la lluvia, es casi mágico.",
                "No creo que haya hecho tanto frío en esta región durante los últimos inviernos.",
                "Si hubiera sabido que haría tanto viento, habría asegurado mejor las ventanas.",
                "Me sorprende que haya estado nevando todo el día sin parar.",
                "Aunque el pronóstico había predicho sol, el cielo permaneció nublado toda la tarde.",
                "Si hubiera sabido lo que sé ahora sobre el clima, habría planeado mejor el evento.",
                "No puedo creer que siga nevando, incluso después de que el pronóstico dijo que pararía.",
                "Si no fuera por el viento, el día habría sido perfecto para salir.",
                "El cielo estaba tan despejado esta mañana, pero ahora parece que va a llover.",
                "Si no hubiera hecho tanto calor, habríamos pasado más tiempo afuera.",
                "El viento soplaba tan fuerte que parecía que iba a derribar los árboles.",
                "Es increíble cómo el clima puede cambiar tan rápido de un momento a otro.",
                "Si hubiera sabido que la tormenta sería tan intensa, no habría dejado el coche afuera.",
                "No me importa que haga frío, siempre y cuando no esté lloviendo."
            ]
        }
},

"Sports": {
    "A1": {
    "grammar": [
        "Simple present tense",
        "Basic noun-verb agreement",
        "Definite and indefinite articles (el, la, un, una)",
        "Personal pronouns (yo, tú, él, ella)",
        "Basic question formation",
        "Basic adjective agreement",
        "Numbers (1-20)"
    ],
    "examples": [
        "Me gusta jugar al fútbol.",
        "¿Juegas al baloncesto?",
        "El tenis es mi deporte favorito.",
        "Mi hermano juega al fútbol todos los días.",
        "El equipo de mi ciudad es muy bueno.",
        "Vamos a correr al parque.",
        "Yo juego al béisbol con mis amigos.",
        "Hoy hay un partido de fútbol.",
        "¿Te gusta el deporte?",
        "Ayer vimos un partido de baloncesto.",
        "El fútbol es muy popular en mi país.",
        "Me encanta nadar en verano.",
        "Voy a jugar al tenis mañana.",
        "Los niños juegan en el campo.",
        "Mi amigo corre todos los días.",
        "¿Sabes jugar al voleibol?",
        "Ella es muy buena en natación.",
        "Este equipo siempre gana.",
        "¿Quién es tu jugador favorito?",
        "Hoy vamos a ver el partido."
    ]
    },
    "A2": {
    "grammar": [
        "Present tense",
        "Question formation",
        "Possessive adjectives (mi, tu, su)",
        "Adjective agreement",
        "Use of 'gustar' (to like)",
        "Prepositions of place (en, a, de)",
        "Basic negation (no)"
    ],
    "examples": [
        "El partido empieza a las cinco.",
        "Mi equipo favorito es el Real Madrid.",
        "¿Qué deporte te gusta practicar?",
        "Me gusta ver los partidos en la televisión.",
        "El baloncesto es más divertido que el fútbol.",
        "El estadio está lleno de gente.",
        "Mañana vamos a jugar al tenis en el club.",
        "No me gusta el baloncesto, prefiero el fútbol.",
        "Ayer corrí cinco kilómetros en el parque.",
        "El voleibol es muy popular en la playa.",
        "El equipo ganó el campeonato el año pasado.",
        "Mi amigo juega al fútbol todos los domingos.",
        "¿Cuál es tu equipo favorito?",
        "Siempre veo los partidos de tenis en la tele.",
        "A mi hermana le gusta jugar al balonmano.",
        "El entrenador es muy estricto con los jugadores.",
        "El ciclismo es un deporte que requiere mucha resistencia.",
        "Mi padre y yo jugamos al golf los fines de semana.",
        "Los jugadores están practicando en el campo.",
        "¿Te gustaría aprender a jugar al tenis?"
    ]
    },
    "B1": {
    "grammar": [
        "Present tense with regular verbs",
        "Basic sentence structure",
        "Prepositions of place (en, a, de)",
        "Direct and indirect object pronouns",
        "Past simple tense (preterite)",
        "Reflexive verbs (levantarse, entrenarse)"
    ],
    "examples": [
        "Ayer jugué al fútbol con mis amigos en el parque.",
        "¿Has probado alguna vez el surf?",
        "El partido fue muy emocionante, ganamos en los últimos minutos.",
        "La semana pasada entrené muy duro para el maratón.",
        "Este año quiero aprender a esquiar en las montañas.",
        "El equipo local ganó la liga el año pasado.",
        "Después de entrenar, siempre me siento mejor.",
        "Nos levantamos temprano para correr antes del trabajo.",
        "El estadio estaba lleno de aficionados.",
        "¿A qué hora empieza el partido de baloncesto?",
        "El tenis es un deporte que requiere mucha concentración.",
        "Ayer fui a ver un partido de fútbol en el estadio.",
        "Los jugadores se están entrenando para el campeonato.",
        "¿Has jugado alguna vez al rugby?",
        "El entrenador nos dio instrucciones antes del partido.",
        "El ciclismo es un deporte que exige mucha resistencia física.",
        "Mi equipo perdió el partido por solo un punto.",
        "El torneo de tenis se celebra cada año en julio.",
        "¿Prefieres los deportes individuales o en equipo?",
        "Ayer corrí diez kilómetros en preparación para la carrera."
    ]
    },
    "B2": {
    "grammar": [
        "Present tense with irregular verbs",
        "Questions and negations",
        "Comparatives and superlatives",
        "Past simple tense (preterite)",
        "Use of reflexive verbs",
        "Future tense",
        "Conditional tense"
    ],
    "examples": [
        "Si tuviera más tiempo, jugaría al fútbol todos los días.",
        "El equipo más fuerte ganó el campeonato.",
        "Espero que mañana no llueva para poder entrenar.",
        "¿Has visto alguna vez un partido de béisbol en directo?",
        "Si entrenas regularmente, mejorarás tu rendimiento.",
        "El partido de tenis fue más largo de lo que esperaba.",
        "No creo que el equipo pueda ganar sin su mejor jugador.",
        "El baloncesto es más rápido que el fútbol, pero ambos son emocionantes.",
        "El torneo de natación se celebrará el próximo mes.",
        "Si tuviera que elegir, preferiría el fútbol al baloncesto.",
        "El año pasado gané mi primera medalla en la competencia de atletismo.",
        "Espero que podamos organizar un partido de voleibol este fin de semana.",
        "El entrenador dijo que si practicamos más, seremos mejores jugadores.",
        "Si pudieras aprender cualquier deporte, ¿cuál elegirías?",
        "¿Cuál es el jugador más famoso de tu equipo favorito?",
        "El surf es un deporte que requiere equilibrio y concentración.",
        "La natación es el deporte más completo para ejercitar todo el cuerpo.",
        "¿Te gustaría participar en un maratón algún día?",
        "El ciclismo de montaña es más peligroso que el ciclismo en carretera.",
        "Si pudiera, practicaría deportes extremos todos los días."
    ]
    },
    "C1": {
    "grammar": [
        "Present continuous tense",
        "Direct and indirect objects",
        "Past continuous tense",
        "Future tense",
        "Conditional tense",
        "Subjunctive mood (intermediate)",
        "Relative clauses"
    ],
    "examples": [
        "Si hubiera sabido que el partido empezaba tan temprano, habría llegado antes.",
        "Estoy entrenando para el maratón que se celebrará en dos meses.",
        "El equipo que gane el próximo partido será el campeón de la liga.",
        "A pesar de que estaba lloviendo, seguimos jugando al fútbol.",
        "No creo que vayamos a ganar el campeonato, pero vamos a intentarlo.",
        "Me pregunto si el equipo podrá superar a sus rivales en el próximo partido.",
        "Si hubiera practicado más, podría haber ganado el torneo de tenis.",
        "Aunque está lesionado, quiere seguir jugando en el próximo partido.",
        "Estoy buscando un equipo de baloncesto en el que pueda inscribirme.",
        "Si el entrenador nos hubiera dado más tiempo para entrenar, habríamos mejorado más.",
        "No me sorprendería si el equipo gana la liga este año.",
        "El jugador que más me inspira es uno que siempre da lo mejor de sí mismo.",
        "Me encantaría participar en una competencia internacional de ciclismo.",
        "Aunque es difícil, quiero mejorar mis habilidades en el surf.",
        "No estoy seguro de que podamos ganar sin nuestro capitán.",
        "El próximo partido será decisivo para el campeonato.",
        "Si el tiempo lo permite, jugaremos el partido al aire libre.",
        "El deporte que más me interesa practicar es la escalada.",
        "El jugador que marcó el gol fue increíblemente rápido.",
        "Si hubiera sabido lo importante que era el partido, habría entrenado más."
    ]
    },
    "C2": {
    "grammar": [
        "Present perfect tense",
        "Reflexive verbs",
        "Subjunctive mood (advanced)",
        "Complex sentence structures",
        "Reported speech",
        "Idiomatic expressions",
        "Advanced relative clauses",
        "Imperfect tense",
        "Pluperfect tense"
    ],
    "examples": [
        "Si no hubiera sido por la lluvia, habríamos jugado el mejor partido de la temporada.",
        "Me dijeron que el equipo rival había estado entrenando mucho más duro que el nuestro.",
        "No creo que haya habido un partido más emocionante en toda la historia del torneo.",
        "Si hubiera sabido que el jugador estaba lesionado, no habría contado con él para el partido.",
        "El entrenador mencionó que el equipo ha estado mejorando su rendimiento en las últimas semanas.",
        "No habría ganado el campeonato si no hubiera entrenado todos los días durante meses.",
        "Si hubiera tenido más tiempo para entrenar, habría corrido más rápido en la carrera.",
        "El partido que vi ayer fue el más emocionante que haya presenciado.",
        "Si hubiera sabido que la competencia iba a ser tan dura, habría empezado a entrenar antes.",
        "El comentarista dijo que este podría haber sido el mejor gol del año.",
        "Si no fuera por su velocidad, el jugador no habría podido marcar el gol.",
        "Me dijeron que el torneo fue cancelado debido al mal tiempo.",
        "Si el equipo hubiera entrenado más duro, habrían ganado el campeonato.",
        "El árbitro mencionó que el partido fue uno de los más difíciles de arbitrar en su carrera.",
        "Aunque el jugador estaba lesionado, jugó de manera excepcional durante todo el partido.",
        "Si hubiera sabido lo complicado que sería el partido, habría cambiado la estrategia.",
        "No puedo creer que el equipo haya perdido en el último minuto.",
        "Si no hubiéramos perdido el primer partido, ahora estaríamos en la final.",
        "El entrenador dijo que el equipo ha estado jugando mejor en los últimos partidos.",
        "El jugador que marcó el gol de la victoria fue el héroe del partido."
    ]
    }
},

    "Work and Career": {
      "A1": {
        "grammar": [
          "Simple present tense",
          "Basic noun-verb agreement",
          "Definite and indefinite articles (el, la, un, una)",
          "Personal pronouns (yo, tú, él, ella)",
          "Basic question formation",
          "Basic adjective agreement",
          "Numbers (1-20)",
          "Common verbs related to work (trabajar, hablar)"
        ],
        "examples": [
          "Yo trabajo en una oficina.",
          "Ella es profesora.",
          "¿Dónde trabajas?",
          "Trabajo de nueve a cinco.",
          "Mi jefe es muy amable.",
          "Él es un médico.",
          "¿A qué te dedicas?",
          "Trabajo en un restaurante.",
          "El lunes voy al trabajo.",
          "Tengo una reunión hoy.",
          "¿Tienes mucho trabajo?",
          "Sí, tengo mucho trabajo.",
          "Mi compañero de trabajo es muy simpático.",
          "Me gusta mi trabajo.",
          "Trabajo de lunes a viernes.",
          "¿Tienes vacaciones?",
          "Sí, tengo una semana de vacaciones.",
          "Ella es ingeniera.",
          "Yo soy estudiante.",
          "Voy a la oficina todos los días."
        ]
      },
      "A2": {
        "grammar": [
          "Present tense",
          "Possessive adjectives (mi, tu, su)",
          "Question formation",
          "Basic prepositions related to work (en, con, para)",
          "Use of 'gustar' (to like)",
          "Basic negation (no)",
          "Numbers (20-100)"
        ],
        "examples": [
          "Trabajo en una empresa grande.",
          "Me gusta trabajar con mis compañeros.",
          "¿Cuántas horas trabajas al día?",
          "Trabajo ocho horas al día.",
          "No me gusta trabajar los fines de semana.",
          "¿Te gusta tu trabajo?",
          "Sí, me gusta mucho.",
          "El jefe de mi amigo es muy estricto.",
          "Tengo una reunión importante mañana.",
          "¿A qué hora empieza tu turno?",
          "Mi turno empieza a las nueve.",
          "Trabajo para una empresa internacional.",
          "¿Tienes compañeros de trabajo?",
          "Sí, tengo muchos compañeros de trabajo.",
          "Mi jefe es muy exigente.",
          "Tengo que entregar un proyecto el viernes.",
          "¿Cómo es tu oficina?",
          "Mi oficina es pequeña pero cómoda.",
          "¿Vas al trabajo en coche?",
          "No, voy al trabajo en tren."
        ]
      },
      "B1": {
        "grammar": [
          "Present tense with regular verbs",
          "Simple past tense (preterite)",
          "Direct and indirect object pronouns",
          "Reflexive verbs (levantarse, prepararse)",
          "Use of 'hay' (there is/are)",
          "Conjunctions (y, o, pero)"
        ],
        "examples": [
          "Ayer tuve una reunión con mi jefe.",
          "Me levanto temprano para ir al trabajo.",
          "Quiero encontrar un nuevo empleo.",
          "El trabajo en equipo es muy importante.",
          "Fui a una entrevista de trabajo la semana pasada.",
          "Hoy tengo que presentar un informe.",
          "¿Con quién trabajas?",
          "Trabajo con mi equipo en este proyecto.",
          "Mi jefe me pidió que terminara el informe.",
          "Trabajo en una empresa que desarrolla software.",
          "Me gusta trabajar desde casa cuando es posible.",
          "Nosotros terminamos el proyecto ayer.",
          "El ambiente de trabajo es muy agradable.",
          "¿Cómo fue tu primer día de trabajo?",
          "Mi compañero de trabajo me ayudó mucho.",
          "Estoy buscando un nuevo puesto en la empresa.",
          "Tengo que prepararme para una reunión.",
          "El salario es uno de los motivos para cambiar de trabajo.",
          "Mi horario es flexible, lo cual es muy conveniente.",
          "Voy a pedir un aumento de sueldo este año."
        ]
      },
      "B2": {
        "grammar": [
          "Present tense with irregular verbs",
          "Past simple tense (preterite)",
          "Future tense",
          "Conditional tense",
          "Subjunctive mood (basic)"
        ],
        "examples": [
          "Si tuviera más experiencia, aplicaría para el puesto.",
          "El próximo mes voy a empezar un nuevo trabajo.",
          "¿Has trabajado en este tipo de proyecto antes?",
          "Si recibo la oferta, aceptaré el empleo.",
          "Espero que la reunión sea productiva.",
          "Si tuviera más tiempo, buscaría un trabajo nuevo.",
          "Mi jefe me pidió que trabajara horas extra esta semana.",
          "¿Qué harías si te ofrecieran un ascenso?",
          "Voy a buscar empleo en otra ciudad.",
          "No creo que tenga tiempo para terminar el proyecto hoy.",
          "Si me hubieran avisado antes, habría preparado la presentación.",
          "Espero que todos lleguen a tiempo a la reunión.",
          "Voy a cambiar de trabajo el próximo año.",
          "Mi compañero de trabajo me dijo que va a renunciar.",
          "El salario que me ofrecieron es muy bueno.",
          "Si tuviera más flexibilidad, podría trabajar desde casa.",
          "Me gustaría trabajar en una empresa internacional.",
          "El jefe nos pidió que entregáramos el informe antes del viernes.",
          "Si hubiera sabido sobre la oferta, habría aplicado antes.",
          "Espero que tengamos una decisión pronto sobre el proyecto."
        ]
      },
      "C1": {
        "grammar": [
          "Present continuous tense",
          "Future tense",
          "Conditional tense",
          "Subjunctive mood (intermediate)",
          "Passive voice",
          "Relative clauses"
        ],
        "examples": [
          "Estoy trabajando en un proyecto importante en este momento.",
          "Si hubiera tenido más tiempo, habría terminado el informe.",
          "Es probable que me ofrezcan un ascenso pronto.",
          "Si me hubieran informado antes, habría hecho los cambios necesarios.",
          "El informe fue presentado por mi compañero de equipo.",
          "El proyecto que estamos desarrollando es muy interesante.",
          "No creo que mi jefe esté contento con el resultado.",
          "Voy a estar trabajando desde casa toda la próxima semana.",
          "Si pudiera cambiar algo de mi trabajo, sería el horario.",
          "El informe que entregamos ayer fue bien recibido.",
          "No estoy seguro de que la empresa apruebe el nuevo presupuesto.",
          "Si hubiera sabido que tendríamos más tiempo, habría hecho una revisión más detallada.",
          "El aumento de sueldo fue aprobado por la gerencia.",
          "El equipo que lidero está trabajando de forma eficiente.",
          "Estoy seguro de que el proyecto será un éxito.",
          "Espero que podamos completar el trabajo antes de la fecha límite.",
          "Si tuviera más recursos, podríamos hacer un mejor trabajo.",
          "La decisión fue tomada por la junta directiva.",
          "El próximo año, la empresa va a expandirse a nuevos mercados.",
          "No creo que podamos cumplir con el plazo sin ayuda adicional."
        ]
      },
      "C2": {
        "grammar": [
          "Present perfect tense",
          "Past continuous tense",
          "Subjunctive mood (advanced)",
          "Complex sentence structures",
          "Reported speech",
          "Idiomatic expressions"
        ],
        "examples": [
          "Si hubiera sabido lo complicado que sería, habría pedido más tiempo.",
          "El proyecto ha sido más difícil de lo que pensaba.",
          "Me dijeron que el presupuesto fue aprobado, pero no estoy seguro.",
          "Aunque el trabajo es exigente, lo disfruto mucho.",
          "Si hubiera tenido más recursos, el resultado habría sido mejor.",
          "Dijeron que la decisión sería tomada hoy, pero todavía no hemos recibido noticias.",
          "No creo que haya sido justo el proceso de selección.",
          "Es probable que el equipo haya terminado el proyecto antes de la fecha límite.",
          "Me gustaría haber trabajado en este proyecto desde el principio.",
          "Si no hubiera tenido ayuda, no habría terminado a tiempo.",
          "El informe fue presentado por mi jefe ayer.",
          "Es probable que haya más oportunidades de crecimiento en el futuro.",
          "Aunque el salario no es el mejor, las condiciones de trabajo son excelentes.",
          "Dudo que pueda encontrar otro trabajo tan bueno como este.",
          "Si me hubieran dado más tiempo, habría hecho una investigación más completa.",
          "Espero que la próxima reunión sea más productiva.",
          "Me gustaría saber si tenemos alguna oportunidad de obtener el contrato.",
          "Si pudiera volver atrás, habría manejado el proyecto de manera diferente.",
          "Dijeron que el proyecto se retrasaría, pero todavía no tenemos una confirmación oficial.",
          "Me sorprende que hayamos terminado antes de lo previsto."
        ]
      }
    },
    
        "Health and Fitness": {
          "A1": {
            "grammar": [
              "Simple present tense",
              "Basic noun-verb agreement",
              "Definite and indefinite articles (el, la, un, una)",
              "Personal pronouns (yo, tú, él, ella)",
              "Basic question formation",
              "Basic adjective agreement",
              "Numbers (1-20)",
              "Common verbs related to health (correr, comer, beber)"
            ],
            "examples": [
              "Yo corro todos los días.",
              "Ella come frutas y verduras.",
              "¿Te gusta hacer ejercicio?",
              "Sí, me gusta mucho hacer ejercicio.",
              "Voy al gimnasio los lunes.",
              "Él bebe mucha agua.",
              "¿Cuántas horas duermes?",
              "Duermo ocho horas cada noche.",
              "El doctor es muy amable.",
              "Tengo un dolor de cabeza.",
              "Hago yoga por la mañana.",
              "¿Qué comes para el desayuno?",
              "Como pan y fruta.",
              "Es importante beber agua.",
              "Voy a caminar después del trabajo.",
              "Ella es muy saludable.",
              "Voy al médico una vez al año.",
              "¿Te gusta correr?",
              "No, prefiero caminar.",
              "Tengo una bicicleta nueva."
            ]
          },
          "A2": {
            "grammar": [
              "Present tense",
              "Possessive adjectives (mi, tu, su)",
              "Basic negation (no)",
              "Prepositions of time (por la mañana, por la tarde)",
              "Basic reflexive verbs (levantarse, ducharse)",
              "Basic expressions of frequency (siempre, a veces)",
              "Numbers (20-100)"
            ],
            "examples": [
              "Me levanto temprano para hacer ejercicio.",
              "Voy al gimnasio tres veces a la semana.",
              "Me gusta correr en el parque.",
              "¿Cuántas veces a la semana haces ejercicio?",
              "Hago ejercicio cuatro veces por semana.",
              "No me gusta correr, prefiero nadar.",
              "Tomo vitaminas todos los días.",
              "Ella come comida saludable.",
              "¿Cuántas horas duermes cada noche?",
              "Duermo ocho horas por noche.",
              "Hago yoga por la mañana.",
              "El médico me dijo que necesito hacer más ejercicio.",
              "No como comida rápida porque no es saludable.",
              "Bebo dos litros de agua cada día.",
              "A veces me duele la espalda después de hacer ejercicio.",
              "Me siento mejor después de correr.",
              "Voy a hacer una caminata el fin de semana.",
              "Es importante dormir bien para la salud.",
              "Tengo una cita con el médico mañana.",
              "Corro cinco kilómetros cada día."
            ]
          },
          "B1": {
            "grammar": [
              "Present tense with regular verbs",
              "Past simple tense (preterite)",
              "Direct and indirect object pronouns",
              "Reflexive verbs (levantarse, prepararse)",
              "Use of 'hay' (there is/are)",
              "Conjunctions (y, o, pero)"
            ],
            "examples": [
              "Ayer fui al gimnasio y corrí durante una hora.",
              "Me levanto temprano para ir a clases de yoga.",
              "Comí una ensalada saludable para el almuerzo.",
              "Después de entrenar, me siento muy bien.",
              "Hay muchas personas que prefieren caminar en lugar de correr.",
              "¿Cuándo empezaste a hacer ejercicio regularmente?",
              "Empecé a hacer ejercicio hace dos años.",
              "Me duele el brazo después de levantar pesas.",
              "¿Qué haces para mantenerte en forma?",
              "Intento comer saludable y hacer ejercicio todos los días.",
              "Voy al gimnasio después del trabajo.",
              "Prefiero correr por la mañana cuando no hace calor.",
              "Comer sano es tan importante como hacer ejercicio.",
              "Mi entrenador me dijo que debo descansar más.",
              "El fin de semana pasado hice una caminata larga en las montañas.",
              "Ella está entrenando para una maratón.",
              "Me gusta hacer ejercicio porque me da energía.",
              "Hice una clase de yoga ayer y me encantó.",
              "Mi dieta incluye muchas frutas y verduras.",
              "El descanso es esencial para una buena salud."
            ]
          },
          "B2": {
            "grammar": [
              "Present tense with irregular verbs",
              "Past simple tense (preterite)",
              "Future tense",
              "Conditional tense",
              "Subjunctive mood (basic)"
            ],
            "examples": [
              "Si tuviera más tiempo, iría al gimnasio todos los días.",
              "Voy a empezar una nueva rutina de ejercicios la próxima semana.",
              "¿Has probado alguna vez una clase de spinning?",
              "Si me siento mejor, iré a correr mañana.",
              "Mi nutricionista me recomendó reducir el azúcar en mi dieta.",
              "Si tuviera que elegir entre yoga y correr, preferiría correr.",
              "No creo que pueda correr una maratón, pero me gustaría intentarlo.",
              "Voy a inscribirme en una competencia de fitness.",
              "El médico me recomendó que camine más cada día.",
              "Si hubiera sabido lo bien que me sentiría, habría empezado antes a hacer ejercicio.",
              "Espero que mi nueva rutina de ejercicios me ayude a sentirme mejor.",
              "Si llueve mañana, haré ejercicio en casa.",
              "No estoy seguro de si podré asistir a la clase de yoga mañana.",
              "Si pudiera, haría ejercicio todos los días sin excepción.",
              "Espero que la clase de hoy no sea tan difícil.",
              "Si pudiera cambiar algo en mi rutina, haría más ejercicios de estiramiento.",
              "Voy a inscribirme en un gimnasio el mes que viene.",
              "Me gustaría correr una maratón algún día.",
              "El descanso es tan importante como el ejercicio.",
              "No creo que pueda hacer yoga todos los días, pero lo intentaré."
            ]
          },
          "C1": {
            "grammar": [
              "Present continuous tense",
              "Future tense",
              "Conditional tense",
              "Subjunctive mood (intermediate)",
              "Passive voice",
              "Relative clauses"
            ],
            "examples": [
              "Estoy entrenando para una competencia de triatlón.",
              "Si hubiera sabido que sería tan difícil, me habría preparado mejor.",
              "Espero que puedas acompañarme a la clase de yoga la próxima semana.",
              "El plan de ejercicios que sigo fue diseñado por un profesional.",
              "El programa que estoy siguiendo está enfocado en la resistencia y la fuerza.",
              "Voy a empezar a entrenar para una maratón el mes que viene.",
              "Si tuviera más tiempo, haría más ejercicios de flexibilidad.",
              "No creo que la dieta que sigo sea la mejor, pero está funcionando.",
              "Si hubiera descansado más, hoy no me sentiría tan cansado.",
              "El médico me recomendó hacer ejercicio moderado cada día.",
              "El plan que sigo incluye ejercicios de cardio y fuerza.",
              "La rutina que hago está diseñada para mejorar mi salud cardiovascular.",
              "Si pudiera cambiar algo, haría más ejercicios al aire libre.",
              "Es importante que descanses entre los entrenamientos para evitar lesiones.",
              "Espero que podamos entrenar juntos la próxima semana.",
              "El descanso después de un entrenamiento intenso es crucial.",
              "El médico me dijo que mi dieta debe mejorar para lograr mejores resultados.",
              "Me encantaría participar en una competencia de fitness algún día.",
              "El entrenamiento que sigo es muy exigente, pero efectivo.",
              "El gimnasio donde entreno tiene excelentes instalaciones."
            ]
          },
          "C2": {
            "grammar": [
              "Present perfect tense",
              "Past continuous tense",
              "Subjunctive mood (advanced)",
              "Complex sentence structures",
              "Reported speech",
              "Idiomatic expressions"
            ],
            "examples": [
              "Si hubiera sabido que el entrenamiento sería tan intenso, me habría preparado mejor.",
              "El entrenador dijo que necesitaba mejorar mi técnica para evitar lesiones.",
              "Si hubiera descansado más, no estaría tan agotado ahora.",
              "Es probable que mi rendimiento mejore con la nueva rutina.",
              "Aunque el entrenamiento es difícil, me siento mejor después de cada sesión.",
              "No creo que haya logrado todos mis objetivos, pero estoy cerca.",
              "Si tuviera más experiencia, me gustaría ser entrenador personal.",
              "Me parece increíble lo rápido que he mejorado mi resistencia.",
              "El médico me recomendó hacer cambios en mi dieta para mejorar mi salud.",
              "Si hubiera sabido lo beneficioso que es el yoga, lo habría empezado antes.",
              "No creo que el programa de ejercicios sea adecuado para todos.",
              "Es importante que sigas un plan de ejercicio que se ajuste a tus necesidades.",
              "Si hubiera tenido más tiempo para descansar, habría tenido un mejor rendimiento.",
              "No estoy seguro de que el ejercicio sea suficiente sin una buena dieta.",
              "Aunque el plan de entrenamiento es intenso, creo que es efectivo.",
              "Si hubiera sabido que el yoga sería tan relajante, lo habría hecho antes.",
              "El médico me dijo que es importante equilibrar la dieta y el ejercicio.",
              "Si hubiera seguido un plan más estricto, habría obtenido mejores resultados.",
              "Es probable que la nueva rutina me ayude a alcanzar mis objetivos.",
              "No creo que pueda seguir este ritmo de entrenamiento por mucho tiempo."
            ]
          }
        },
          

  
  
"Clothing": {

},

"Music": {

},
"Animals": {

},

"Travel": {
    "A1": {
      "grammar": [
        "Simple present tense",
        "Basic noun-verb agreement",
        "Definite and indefinite articles (el, la, un, una)",
        "Personal pronouns (yo, tú, él, ella)",
        "Basic question formation",
        "Basic adjective agreement",
        "Numbers (1-20)"
      ],
      "examples": [
        "Voy a la playa.",
        "¿Dónde está el hotel?",
        "Me gusta viajar.",
        "Voy en avión a España.",
        "¿Cuándo sale el tren?",
        "El autobús llega a las tres.",
        "Tengo una reserva en el hotel.",
        "¿Dónde está la estación de tren?",
        "Quiero comprar un boleto de avión.",
        "El avión es muy rápido.",
        "Voy a visitar un museo.",
        "¿Tienes un mapa de la ciudad?",
        "Voy a México de vacaciones.",
        "¿Cuánto cuesta el boleto?",
        "Este es mi pasaporte.",
        "Necesito cambiar dinero.",
        "¿Cómo llego al aeropuerto?",
        "El taxi está aquí.",
        "Voy a viajar el próximo mes.",
        "¿Cuál es tu destino favorito?"
      ]
    },
    "A2": {
      "grammar": [
        "Present tense",
        "Question formation",
        "Possessive adjectives (mi, tu, su)",
        "Adjective agreement",
        "Use of 'gustar' (to like)",
        "Prepositions of place (en, a, de)",
        "Basic negation (no)"
      ],
      "examples": [
        "Me gustaría viajar a Europa el próximo verano.",
        "¿Cuándo sale el próximo tren a Barcelona?",
        "Voy de vacaciones a la playa cada año.",
        "La semana pasada fui a visitar a mi familia en otra ciudad.",
        "¿Puedes recomendarme un buen hotel en Madrid?",
        "El vuelo se retrasó dos horas.",
        "Quiero hacer una reserva para una habitación doble.",
        "El viaje en autobús duró tres horas.",
        "Mi destino favorito es París porque es muy bonito.",
        "El hotel tiene una piscina grande.",
        "Voy a tomar un taxi al aeropuerto mañana.",
        "Me encanta viajar en tren porque es muy cómodo.",
        "¿Cuánto cuesta un boleto de ida y vuelta?",
        "El avión despega a las ocho de la mañana.",
        "Siempre llevo una cámara cuando viajo.",
        "Vamos a hacer un tour por la ciudad mañana.",
        "¿Puedes decirme dónde está la estación de autobuses?",
        "¿Qué tipo de transporte prefieres para viajar?",
        "El hotel está cerca del centro de la ciudad.",
        "¿A qué hora sale el autobús?"
      ]
    },
    "B1": {
      "grammar": [
        "Present tense with regular verbs",
        "Basic sentence structure",
        "Prepositions of place (en, a, de)",
        "Direct and indirect object pronouns",
        "Past simple tense (preterite)",
        "Reflexive verbs (levantarse, prepararse)"
      ],
      "examples": [
        "Ayer viajé en tren a una ciudad que nunca había visitado.",
        "El año pasado fui de vacaciones a Italia, fue increíble.",
        "¿Has reservado el hotel para el próximo mes?",
        "El vuelo duró más de lo esperado debido a las malas condiciones climáticas.",
        "Siempre me preparo con antelación para los viajes largos.",
        "¿Has visitado alguna vez un lugar exótico?",
        "Antes de viajar, me gusta investigar sobre la cultura local.",
        "El hotel en el que nos quedamos tenía una vista espectacular del mar.",
        "El autobús nos dejó justo en la entrada del parque nacional.",
        "¿Cuándo fue la última vez que hiciste un viaje largo?",
        "El verano pasado recorrí varias ciudades de España.",
        "Me encanta descubrir nuevos lugares cuando viajo.",
        "Siempre llevo una mochila con lo esencial cuando hago excursiones.",
        "¿Cuál fue el mejor viaje que has hecho?",
        "Durante mis vacaciones, visité muchos museos interesantes.",
        "La estación de tren estaba llena de turistas.",
        "¿Sabes a qué hora llega el tren a Madrid?",
        "El vuelo fue largo, pero el destino valió la pena.",
        "El conductor del taxi fue muy amable y nos dio recomendaciones.",
        "¿Cómo prefieres viajar, en avión o en tren?"
      ]
    },
    "B2": {
      "grammar": [
        "Present tense with irregular verbs",
        "Questions and negations",
        "Comparatives and superlatives",
        "Past simple tense (preterite)",
        "Use of reflexive verbs",
        "Future tense",
        "Conditional tense"
      ],
      "examples": [
        "Si tuviera más tiempo, me gustaría viajar por todo el mundo.",
        "El próximo año planeo hacer un viaje en solitario por Asia.",
        "¿Qué país te gustaría visitar si tuvieras la oportunidad?",
        "Si viajo a Sudamérica, quiero explorar la selva amazónica.",
        "El viaje en avión fue más cómodo de lo que esperaba.",
        "Si pudieras elegir cualquier destino, ¿a dónde irías?",
        "Me pregunto cómo será viajar a un país con una cultura tan diferente.",
        "El viaje a las montañas fue más desafiante que cualquier otro que haya hecho.",
        "¿Alguna vez has pensado en hacer un viaje largo en coche?",
        "Si tuviera más dinero, viajaría más a menudo.",
        "Este hotel es más caro que el que nos recomendaron, pero tiene mejores vistas.",
        "En mi próximo viaje, me gustaría probar nuevas experiencias de aventura.",
        "Si las condiciones climáticas no mejoran, el vuelo podría cancelarse.",
        "Me gustaría ir a un lugar donde no haya muchos turistas.",
        "Siempre llevo un diario de viaje para anotar mis experiencias.",
        "¿Te gustaría aprender un nuevo idioma antes de viajar a otro país?",
        "El tren es una de las formas más relajantes de viajar largas distancias.",
        "Si pudiera, pasaría todo el año viajando por diferentes continentes.",
        "El turismo sostenible es una de las mejores formas de viajar hoy en día.",
        "Espero que en mi próximo viaje pueda ver la aurora boreal."
      ]
    },
    "C1": {
      "grammar": [
        "Present continuous tense",
        "Direct and indirect objects",
        "Past continuous tense",
        "Future tense",
        "Conditional tense",
        "Subjunctive mood (intermediate)",
        "Relative clauses"
      ],
      "examples": [
        "Si hubiera sabido que el vuelo se iba a retrasar tanto, habría reservado en otro horario.",
        "Estoy planeando un viaje a Japón para conocer mejor su cultura.",
        "El próximo verano estaré viajando por Europa durante tres meses.",
        "El vuelo se canceló debido a una tormenta, así que tuve que quedarme una noche más.",
        "Si hubiera investigado más, habría encontrado un hotel más barato.",
        "Me gustaría conocer la historia detrás de cada lugar que visito.",
        "El tren estaba tan lleno que tuvimos que esperar al siguiente.",
        "Si el clima lo permite, mañana haremos una excursión a la montaña.",
        "No creo que haya un lugar más bonito que las playas del Caribe.",
        "Estoy buscando recomendaciones de lugares para visitar durante mi viaje a Italia.",
        "Si hubiera más tiempo, visitaríamos también los pueblos cercanos.",
        "Aunque el viaje fue largo, las vistas desde el avión valieron la pena.",
        "El hotel en el que nos quedamos fue construido en el siglo XVIII.",
        "Me encantaría participar en una ruta gastronómica durante mis vacaciones.",
        "Si pudiera, viajaría cada vez que tuviera la oportunidad.",
        "No puedo esperar a conocer todas las maravillas que este país tiene para ofrecer.",
        "El guía nos explicó la historia del lugar con mucho detalle.",
        "Si el vuelo hubiera salido a tiempo, habríamos llegado mucho más temprano.",
        "Estoy planeando hacer un viaje en bicicleta por los Alpes.",
        "Si no hubiera sido por la lluvia, habríamos pasado todo el día explorando la ciudad."
      ]
    },
    "C2": {
      "grammar": [
        "Present perfect tense",
        "Reflexive verbs",
        "Subjunctive mood (advanced)",
        "Complex sentence structures",
        "Reported speech",
        "Idiomatic expressions",
        "Advanced relative clauses",
        "Imperfect tense",
        "Pluperfect tense"
      ],
      "examples": [
        "Si no hubiera sido por la huelga, el tren habría llegado a tiempo.",
        "Me comentaron que el lugar que visité el año pasado ya no está tan lleno de turistas.",
        "Si hubiera sabido lo caro que sería viajar en temporada alta, habría cambiado mis planes.",
        "El viaje fue mucho más enriquecedor de lo que había imaginado.",
        "Si no hubiera llovido durante toda la semana, habríamos explorado más la ciudad.",
        "El guía nos contó que el castillo fue reconstruido tras un incendio hace siglos.",
        "Me sorprende que nunca antes haya visitado un lugar tan impresionante como este.",
        "Si no fuera por el costo del vuelo, habría viajado a Australia hace tiempo.",
        "Me dijeron que las rutas de senderismo en esa zona son espectaculares.",
        "Si hubiera planeado mejor, habría visitado más lugares durante mis vacaciones.",
        "Es cierto que viajar por el mundo te abre la mente y te cambia la perspectiva.",
        "Si no hubiera habido tantas restricciones, habríamos hecho más excursiones.",
        "El agente de viajes me comentó que este destino es muy popular entre los mochileros.",
        "Me dijeron que los viajes en tren por Europa son una experiencia inolvidable.",
        "Si hubiera sabido lo emocionante que es viajar en globo, lo habría hecho antes.",
        "El hecho de que el vuelo se haya retrasado no arruinó mi experiencia.",
        "Me contaron que el hotel en el que me quedé fue uno de los primeros en la ciudad.",
        "Si no hubiéramos perdido el avión, habríamos llegado a tiempo para la ceremonia.",
        "Si no fuera tan complicado obtener una visa, me habría quedado más tiempo.",
        "No me cabe duda de que este ha sido el mejor viaje de mi vida."
      ]
    }
  },
  "Food": {
    "A1": {
      "grammar": [
        "Simple present tense",
        "Basic noun-verb agreement",
        "Definite and indefinite articles (el, la, un, una)",
        "Personal pronouns (yo, tú, él, ella)",
        "Basic question formation",
        "Basic adjective agreement",
        "Numbers (1-20)"
      ],
      "examples": [
        "Me gusta la pizza.",
        "¿Tienes agua?",
        "Quiero una manzana.",
        "El pan es delicioso.",
        "Tengo hambre.",
        "Voy a comer una ensalada.",
        "¿Dónde está el restaurante?",
        "El helado es mi postre favorito.",
        "Necesito un cuchillo para cortar el pan.",
        "Quiero una taza de café.",
        "El arroz está caliente.",
        "¿Qué te gusta comer?",
        "El pescado es muy fresco.",
        "¿Puedo tener más agua, por favor?",
        "Me encanta el chocolate.",
        "La sopa está muy buena.",
        "Tengo sed.",
        "¿Quieres una naranja?",
        "El desayuno está listo.",
        "Comemos juntos todos los días."
      ]
    },
    "A2": {
      "grammar": [
        "Present tense",
        "Question formation",
        "Possessive adjectives (mi, tu, su)",
        "Adjective agreement",
        "Use of 'gustar' (to like)",
        "Prepositions of place (en, a, de)",
        "Basic negation (no)"
      ],
      "examples": [
        "Me gusta la comida italiana, especialmente la pasta.",
        "¿Qué te gustaría comer para la cena?",
        "El restaurante donde comimos ayer estaba muy bueno.",
        "Prefiero el té en lugar del café.",
        "¿Qué tipo de carne prefieres, pollo o res?",
        "El pan está fresco porque lo compré esta mañana.",
        "A mi hermano le gusta cocinar postres.",
        "Voy a hacer una ensalada con tomate y lechuga.",
        "No me gusta la comida picante.",
        "El menú tiene muchas opciones vegetarianas.",
        "¿Te gustaría más arroz o más papas?",
        "El pastel de chocolate es mi favorito.",
        "Siempre tomo café con leche en el desayuno.",
        "Ayer cenamos en un restaurante mexicano.",
        "Los tomates están en la nevera.",
        "¿Puedes pasarme la sal, por favor?",
        "Mi madre cocina muy bien.",
        "Me gustaría una botella de agua, por favor.",
        "El pescado se cocina en el horno.",
        "Mi plato favorito es la paella."
      ]
    },
    "B1": {
      "grammar": [
        "Present tense with regular verbs",
        "Basic sentence structure",
        "Prepositions of place (en, a, de)",
        "Direct and indirect object pronouns",
        "Past simple tense (preterite)",
        "Reflexive verbs (prepararse, servirse)"
      ],
      "examples": [
        "Ayer preparé una cena especial para mi familia.",
        "Siempre me sirvo una taza de café por la mañana.",
        "El mesero nos recomendó probar el plato del día.",
        "¿Has probado alguna vez la comida japonesa?",
        "Me encanta cocinar, especialmente platos con muchos ingredientes frescos.",
        "La última vez que fuimos a ese restaurante, el servicio fue excelente.",
        "¿Qué prefieres para el almuerzo, una ensalada o un sándwich?",
        "Ayer cenamos en casa porque no queríamos salir.",
        "El camarero nos trajo el menú y nos explicó los platos.",
        "Me gusta probar nuevas recetas cada semana.",
        "Anoche preparé una pasta con salsa de tomate casera.",
        "El desayuno es la comida más importante del día.",
        "¿Te gustan las frutas tropicales como el mango y la piña?",
        "Cuando voy al supermercado, siempre compro verduras frescas.",
        "La cena de anoche fue deliciosa, hicimos pizza casera.",
        "No me gusta mucho la carne, prefiero las verduras.",
        "El chef de este restaurante es muy famoso por sus postres.",
        "Cuando era niño, no me gustaba el brócoli, pero ahora lo disfruto.",
        "Siempre cocino con aceite de oliva porque es más saludable.",
        "El plato principal fue increíble, especialmente la salsa."
      ]
    },
    "B2": {
      "grammar": [
        "Present tense with irregular verbs",
        "Questions and negations",
        "Comparatives and superlatives",
        "Past simple tense (preterite)",
        "Use of reflexive verbs",
        "Future tense",
        "Conditional tense"
      ],
      "examples": [
        "Si tuviera más tiempo, aprendería a cocinar platos internacionales.",
        "El pastel de manzana que hiciste es el mejor que he probado.",
        "Me pregunto si podrías enseñarme a hacer esa receta.",
        "La próxima semana voy a hacer una cena especial para mis amigos.",
        "Si tuvieras que elegir un plato para comer todos los días, ¿cuál sería?",
        "El restaurante al que fuimos ayer tenía mejores platos que este.",
        "La comida en este país es más picante de lo que esperaba.",
        "Si viajo a Italia, me encantaría aprender a hacer pizza auténtica.",
        "El chef nos explicó cómo preparó el plato usando ingredientes frescos.",
        "La comida en este restaurante es mucho más saludable que en otros lugares.",
        "Si pudieras probar cualquier comida del mundo, ¿qué elegirías?",
        "No creo que pueda terminar este plato, es muy grande.",
        "El vino que nos sirvieron fue excelente, me gustaría comprar una botella.",
        "Este plato es tan bueno que lo podría comer todos los días.",
        "El servicio en este restaurante es mejor que en el que fuimos la semana pasada.",
        "Si pudiera, cocinaría más a menudo en casa.",
        "¿Te gustaría aprender a cocinar comida tailandesa?",
        "El próximo mes voy a asistir a un curso de cocina.",
        "La comida en este país es muy variada, desde carnes hasta mariscos.",
        "Si supiera hacer sushi, lo prepararía para la fiesta de esta noche."
      ]
    },
    "C1": {
      "grammar": [
        "Present continuous tense",
        "Direct and indirect objects",
        "Past continuous tense",
        "Future tense",
        "Conditional tense",
        "Subjunctive mood (intermediate)",
        "Relative clauses"
      ],
      "examples": [
        "Si hubiera sabido que tenías alergia al gluten, habría preparado algo diferente.",
        "Estoy cocinando una cena especial para celebrar nuestro aniversario.",
        "El chef dijo que estaría preparando el menú especial solo esta semana.",
        "Aunque estaba llena, no pude resistir la tentación de probar el postre.",
        "El próximo año estaré tomando clases de cocina internacional.",
        "Si tuviera que elegir un plato que me representa, sería la paella.",
        "El restaurante en el que cenamos anoche es famoso por su comida tradicional.",
        "Espero que este plato te guste tanto como a mí.",
        "Me encanta preparar postres, especialmente tartas de frutas.",
        "Si hubiera más ingredientes frescos disponibles, cocinaría más en casa.",
        "Si me hubieras dicho que no comías carne, habría preparado algo diferente.",
        "No creo que haya un postre más delicioso que el tiramisú.",
        "El camarero nos recomendó un vino que combinaba perfectamente con el plato.",
        "La cena que preparé ayer fue la mejor que he hecho en mucho tiempo.",
        "Aunque no soy un gran fan de las verduras, esta receta es increíble.",
        "Estoy buscando una receta que sea fácil de hacer pero que también impresione a los invitados.",
        "El chef nos explicó que utiliza ingredientes locales en todos sus platos.",
        "Si no fuera tan caro, iría a ese restaurante más a menudo.",
        "El hecho de que utilicen ingredientes frescos hace que la comida sea aún mejor.",
        "Si hubiera sabido lo fácil que es hacer este plato, lo habría intentado antes."
      ]
    },
    "C2": {
      "grammar": [
        "Present perfect tense",
        "Reflexive verbs",
        "Subjunctive mood (advanced)",
        "Complex sentence structures",
        "Reported speech",
        "Idiomatic expressions",
        "Advanced relative clauses",
        "Imperfect tense",
        "Pluperfect tense"
      ],
      "examples": [
        "Si no hubiera sido por la receta que me diste, no habría podido preparar este plato tan delicioso.",
        "Me dijeron que el chef de este restaurante había trabajado en Francia antes de abrir su propio local.",
        "El plato que probamos anoche fue mucho más complejo de lo que había imaginado.",
        "Si hubiera sabido que el vino complementaba tan bien el plato, lo habría pedido antes.",
        "Me contaron que el restaurante utiliza ingredientes que ellos mismos cultivan en su jardín.",
        "Es increíble cómo un solo ingrediente puede cambiar por completo el sabor de un plato.",
        "Si hubiera sabido lo fácil que es hacer esta receta, la habría preparado hace mucho tiempo.",
        "El chef mencionó que su plato estrella ha sido perfeccionado durante años.",
        "Si no fuera por la textura de la comida, habría disfrutado más del plato.",
        "Me dijeron que este restaurante es conocido por su cocina innovadora.",
        "El hecho de que utilicen ingredientes orgánicos mejora mucho la calidad de la comida.",
        "Si no me hubieras recomendado este lugar, nunca habría probado una comida tan exquisita.",
        "El pastel que comimos ayer era el mejor que he probado en toda mi vida.",
        "Me contaron que el restaurante donde cenamos anoche había ganado varios premios.",
        "Si no hubiera tenido tanta hambre, no habría terminado todo el plato.",
        "Me dijeron que el chef había trabajado con algunos de los mejores cocineros del mundo.",
        "Si hubiera sabido que esta receta era tan complicada, no me habría atrevido a intentarla.",
        "El hecho de que el chef prepare cada plato al momento lo hace aún más impresionante.",
        "No puedo creer que nunca antes hubiera probado una comida tan deliciosa.",
        "Me contaron que la comida que probamos anoche es típica de la región y se prepara con ingredientes locales."
      ]
    }
  }
  
  
    
}


   
  
